Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: He commanded me to leave the bedroom immediately.
jbo: ko'a minde mi lo nu ri cazi cliva lo ckaku'a

source: That's very big.
jbo: ta barda mutce

source: Let's go by bus.
jbo: .e'u klama fu lo sorprekarce

source: Choose the one you like.
jbo: ko cuxna lo se nelci

source: Who is that person?
jbo: ta noi prenu cu mo

source: I often play soccer after class.
jbo: mi pi so'i roi boltipyjvi ba lo ctufau

source: My cat killed this mouse.
jbo: lo mi mlatu co'i catra lo vi smacu

source: He has three daughters.
jbo: ci da tixnu ra

source: The pie is delicious.
jbo: lo nabypalne cu kukte

source: I paid about 50 dollars.
jbo: .i mi pleji lo rupnu be li ji'i mu no

source: She always gets up early.
jbo: ra roroi co'a cikna co clira

source: Yesterday I bought a book.
jbo: ca lo purlamdei mi terve'u lo cukta

source: The French flag is blue, white, and red.
jbo: lo fraso lanci cu blanu je blabi je xunre

source: Yesterday I helped the father.
jbo: ca lo prulamdei mi sidju lo patfu

source: This book is about stars.
jbo: le vi cukta cu srana lo tarci

source: He is short but strong.
jbo: ra tordu gi'e ku'i tsali

source: Go to sleep.
jbo: ko co'a sipna

source: Aoi is a good dancer.
jbo: la'oi Aoi xamgu dansu

source: I did it myself.
jbo: mi pu zukte si'anai

source: You work too much.
jbo: do gunka dukse

source: I think, therefore I am.
jbo: mi jinvi gi'e ni'i zasti

source: Shit happens.
jbo: loi kalci pe'a cu fasnu

source: This is a friend of mine.
jbo: ti pendo mi

source: I work in a hospital.
jbo: mi gunka va'o lo spita

source: I'm lost.
jbo: mi djuno noda lo se zvati be mi

source: Is it cloudy?
jbo: .i xu dilnu tcima

source: Is this your family?
jbo: xu ti lanzu do

source: It hurts here.
jbo: cortu ti

source: It is too late.
jbo: dukse lerci

source: It's big!
jbo: barda .u'e

source: It's raining.
jbo: ca'o carvi

source: Love John.
jbo: iu mi'e djan

source: May I help you?
jbo: e'apei mi sidju do

source: My parents don't understand me.
jbo: lo mi rirni cu na jimpe fi mi

source: Oh, now I understand.
jbo: .u'a mi ca jimpe

source: Pablo and Mara were here.
jbo: la.pablos. joi la.mari,as. pu zvati ti

source: Please write it down.
jbo: e'o do ciska ta

source: See you soon.
jbo: viska do bazi

source: She likes to read.
jbo: ra nelci lo nu tcidu

source: She likes to run.
jbo: ra nelci lo nu bajra

source: This is her house.
jbo: ti zdani ra

source: This is his house.
jbo: ti zdani ra

source: Hungry?
jbo: xu xagji

source: Too many cooks spoil the broth.
jbo: i du'e lo jukpa cu pofygau lo stasu

source: Evidently her mother started screaming.
jbo: za'a lo mamta be ra co'a krixa

source: I lost my key.
jbo: mi pu cirko lo mi ckiku

source: Crazy!
jbo: cizra

source: He can speak five languages.
jbo: ra se bangu mu da

source: What do they speak in America?
jbo: ma bangu loi merko

source: This is your dog.
jbo: lo vi gerku cu selpo'e do

source: I am American.
jbo: mi merko

source: She loves classical music, whereas I prefer jazz.
jbo: ko'a nelci lo nolzgi .i ku'i mi nelci lo dja'aza

source: She sells flowers.
jbo: ko'a vecnu lo xrula

source: She's had a hard life.
jbo: ra pu lifri lo nandu nunji'e

source: That hurts.
jbo: mi cortu

source: That man is dead.
jbo: lo va nanmu cu morsi

source: The brown horse is fast.
jbo: le bunre xirma pu'i sutra

source: The father washes his face.
jbo: le patfu cu lumci lo flira be lo nei

source: The girl doesn't like to play soccer.
jbo: lo nixli na nelci lo ka kelci lo fudbolo

source: The teacher and the pupils are in the museum.
jbo: pa ctuca .e za'u tadni ku zvati la muzga

source: The window is open.
jbo: lo canko ku kalri

source: There has been an accident.
jbo: pu snuti

source: They are eating a sandwich.
jbo: za'u ta ca'o citka pa snuji

source: They are listening to the radio.
jbo: ko'a tinju'i lo se cradi

source: This city is in France.
jbo: lo vi tcadu ku se stuzi lo frasygugde

source: This is my old bicycle.
jbo: ti pe mi slabu relxilma'e

source: This is very important.
jbo: ti mutce vajni

source: I've brought a cup of coffee.
jbo: mi pu terve'u lo kabri be lo ckafi

source: Wait for me!
jbo: ko denpa tu'a mi

source: Weather changes often.
jbo: lo tcima ta'e ficybi'o

source: Welcome to Columbia!
jbo: fi'i do zanvi'e fi la .kolumbias.

source: Welcome to our home!
jbo: fi'i do zanvi'e fi lo mi'a zdani

source: Welcome to our restaurant!
jbo: fi'i do zanvi'e fi lo mi'a gusta

source: What are you thinking of?
jbo: do pensi ma

source: What have you done today?
jbo: do mo'u mo ca lo cabdei

source: What is that?
jbo: ta mo

source: What he did wasn't wrong.
jbo: tu'a ko'a cu na'e xlali

source: Let's drop by his house.
jbo: .e'u mi'o klama lo ra zdani

source: Can you put up with the way he behaves?
jbo: xu do ka'e renvi lo seltra be ra

source: Mrs. Smith cleans that room.
jbo: la .nin.smit. cu jisygau le va kumfa

source: Hi, everybody!
jbo: coi ro do

source: Iron is a useful metal.
jbo: lo tirse ku plixau jinme

source: He doesn't have any friends to play with.
jbo: ko'a se pendo no da poi ke'a kelci

source: The little fridge is dirty.
jbo: .i lo cmalu lekmi'i cu to'e jinsa

source: My butt hurts.
jbo: .i mi cortu lo zargu

source: He is drunk.
jbo: .i xalbebna

source: My friend studies Korean.
jbo: lo pendo be mi cu tadni lo bangrgogurio

source: I was wrong.
jbo: mi pu naldrani

source: Hi, how are you?
jbo: coi .i pei

source: I will shoot him.
jbo: mi ba celgunta ra

source: "Do you speak German?" "No, I don't."
jbo: lu xu do se bangu lo dotybau li'u lu na go'i li'u

source: That's not a cat. That's a dog.
jbo: ta na mlatu .i ta gerku

source: Thanks for the info.
jbo: mi ckire fi lo co'e be lo datni

source: Are you angry?
jbo: .o'onaipei

source: He was brave.
jbo: ko'a pu virnu

source: His girlfriend is Japanese.
jbo: lo ta fetsi pendo ku ponjo

source: Please be polite.
jbo: e'o ko clite

source: The mathematics class is good.
jbo: lo mekso ve ctuca ku xamgu

source: Pakistan is a Muslim country.
jbo: la pakistan muslo gugde

source: No.
jbo: .ie nai

source: Yes.
jbo: .ie

source: Let's go now.
jbo: e'u ca klama

source: Yum yum!
jbo: kukte

source: You too, Brutus?
jbo: xu do ji'a doi brutus

source: Let's make our own language so no one will know what we're talking about!
jbo: .i mi jo'u ko zbasu lo bangu poi mi'o po'o jimpe mu'i lo nu no da jimpe lo te tavla pe mi'o

source: This candy cane tastes like green apple.
jbo: ti poi grana titspi ku'o lo crino plise cu simsa lo vrusi

source: Waking up is the opposite of going to sleep.
jbo: lenu cikybi'o cu du lenu to'e sipybi'o

source: He has a lot of money.
jbo: ko'a ponse za'u lo jdini

source: A cat is not a person!
jbo: lo mlatu ku na'e prenu

source: Are they friends?
jbo: xu ko'a simxu pendo

source: I went to Europe once.
jbo: mi pu paroi zvati lo ropno

source: Guns don't kill people. People kill people.
jbo: lo celxa'i na catra lo prenu .i lo prenu cu catra lo prenu

source: Dude, she's hot!
jbo: .u'e melbi

source: Our mother bought us a puppy.
jbo: le mamta be mi'o cu terve'u lo cifyge'u seva'u mi'o

source: There are sixty seconds in a minute.
jbo: lo mentu cu du lo snidu be li xano

source: She was lying on the floor, strangled by a harp string.
jbo: ko'a noi pu vreta lo loldi cu se vaxydicra fi lo gitsko

source: Who's the boy swimming over there?
jbo: lo nanla noi va limna cu mo

source: I live in this hotel.
jbo: mi xabju ti xotli

source: This is not your book, it's mine.
jbo: ti na me do cukta .i ri me mi co'e

source: I'm a translator.
jbo: mi fanvypre

source: I forgot his name.
jbo: mi de'a morji lo cmene be ko'a

source: You can trust him.
jbo: do ka'e lacri ra

source: I want to eat kimbap.
jbo: mi djica lo nu citka la kimbab.

source: In accepting the money, he lost the respect of the people.
jbo: ca lo nu cpacu lo jdini kei ko'a cirko lo ka sinma ce'u

source: The dog is mine.
jbo: lo vi gerku cu se ralte mi

source: She lives nearby.
jbo: ko'a xabju viku

source: Aren't you tired?
jbo: xu do na tatpi

source: He has many history books.
jbo: ra ralte so'i lo citri cukta

source: This bicycle is mine.
jbo: le vi relxilma'e mi se srana

source: Products with GMO are dangerous to human life.
jbo: lo se cupra poi vasru lo jgina stika jmive cu jmive ckape lo remna

source: Please don't forget to send out the letters.
jbo: e'o do tolmorji nai lo ka benji za'u le xatra

source: Apparently, the bus is late.
jbo: za'a tu'a lo basfa cu lerci

source: Jupiter is the largest planet in the Solar System.
jbo: la .DJUpitr. cu barda traji fo le'i plini be ne'i levi tarci'e

source: Nice to meet you.
jbo: .oinai mi simpe'i do

source: I live in Milan.
jbo: mi se zdani la Milan

source: I can sing well.
jbo: mi kakne lo nu xamgu sanga

source: She has very good manners.
jbo: ra xamgu tarti

source: She sat on the bench.
jbo: ra pu zutse lo stizu

source: She felt herself being lifted up.
jbo: ko'a zgana lo nu ko'a se lafti

source: Are you a doctor?
jbo: xu do mikce

source: Are you new here?
jbo: xu do citno vi

source: Thanks for the memories.
jbo: ckire fi lo nu morji

source: One of my dreams is to learn Icelandic.
jbo: me pa lo se senva be mi fa lo nu cilre tu'a lo islenska

source: We'll go when the rain stops.
jbo: mi'o klama ca lo nu co'u carvi

source: We'll go when it quits raining.
jbo: mi'o klama ca lo nu co'u carvi

source: It was a lot of fun.
jbo: pu mutce zdile

source: I haven't studied that much!
jbo: mi na tadni rau roi

source: We went there to plant saplings.
jbo: mi'o pu klama tezu'e lo nu sombo

source: He spoke truth.
jbo: ko'a cusku lo jetnu

source: Hello, how are you doing?
jbo: coi do mo

source: Please drive the car more slowly.
jbo: e'o ko sazri fi'o snomau

source: This is impossible!
jbo: tolcu'i cai

source: I don't understand this.
jbo: mi na jimpe ti

source: I don't believe in God.
jbo: mi na krici fi lo cevni

source: What is your sister doing now?
jbo: lo mensi be do cu ca mo

source: I'm angry.
jbo: mi fengu

source: I like the mountains more than I like the sea.
jbo: lo cmana cu zmadu lo xamsi lo ka se nelci be mi

source: I have a cat and a dog. The cat's black and the dog's white.
jbo: mi ralte lo mlatu e lo gerku .i my xekri .i je gy blabi

source: She is poor, but she is happy.
jbo: ra pindi .i ku'i ra gleki

source: He is a smart boy.
jbo: ta stati nakla

source: The dog is dead.
jbo: le mlatu cu morsi

source: In Hawaii you can swim in the sea all year.
jbo: bu'u la.xauaiis. ka'e limna lo xamsi ze'e lo nanca

source: My name is Farshad.
jbo: mi'e la .farcad.

source: Is Mother scolding the horse?
jbo: xu la.mam. sfasa lo xirma

source: Hi. How are you?
jbo: coi .i pei

source: France is a republic.
jbo: lo fasygu'e cu gubyseltru

source: Leave it!
jbo: .e'u .u'anai

source: God can do anything!
jbo: lo cevni cu kakne ro zo'e

source: I'm not willing to take that risk.
jbo: mi tolcurmi lo bi'unai capfu'a

source: He is studying at his desk.
jbo: ra ca tadni bu'u lo ra jubme

source: His eyes are wet with tears.
jbo: lo kanla be ra cu cilmo lo selklaku

source: You play Starcraft really well.
jbo: .i do mutce co certu lo nu kelci la starkraft

source: What is love?
jbo: ma nu prami

source: It's your book.
jbo: lo cukta cu se srana do

source: Are you Japanese?
jbo: xu do ponjo

source: Oh! Really?
jbo: ge'e xu jetnu

source: There were hundreds of people there.
jbo: so'o panono da zvati tu

source: Whose guitar is this?
jbo: ma se srana ti poi jgita

source: What are you up to?
jbo: do ca mo

source: Goodbye!
jbo: co'o

source: He stood up.
jbo: ra co'a sanli

source: I live in Izmir.
jbo: mi se zdani la izmir

source: You may go.
jbo: .e'a do cliva

source: I saw him.
jbo: mi pu viska ta

source: Russian girls love Icelanders.
jbo: lo rusko nixli cu nelci lo islant se zdani

source: You're not a doctor.
jbo: do na mikcu

source: My father is only fifteen years old.
jbo: lo me mi patfu ku nanca li mo'a pamu

source: His brother studies very hard.
jbo: lo me ta bruni ku mutce carmi cilre

source: It's a good question.
jbo: la'e di'u xamgu preti

source: I live in Hyogo Prefecture.
jbo: mi se zdani la xiogos poi vipsi gugde

source: The capital city of the Netherlands is Amsterdam.
jbo: la .amsterdam. raltca lo gugdenulu

source: Hello, I am Sepideh.
jbo: coi mi'e sepide

source: Where are we?
jbo: mi'o zvati ma

source: "Tatoeba" means "for example" in Japanese.
jbo: zo'oi Tatoeba se smuni zo mu'a bau lo ponjo

source: In some situations, telling a white lie could be used to avoid people to be disappointed or get angry by or with someone.
jbo: .i va'o su'oda lo ka ticysku cu selzu'e da'i fi lo nu na selja'e lo nu se fengu nagi'enai tolmansa

source: The dog is white.
jbo: le gerku cu blabi

source: Close your book.
jbo: ko ga'orgau lo do cukta

source: She is living in the village.
jbo: ta se zdani lo cmatca

source: He weighs ten more kilos than me.
jbo: ra zmadu mi lo ka tilju kei lo pano ki'ogra

source: Yoda's grammar learned you have.
jbo: fe tu'a lo gerna pe la.iodas. co'a certu fa do

source: I'm not a sentence. I should be deleted from Tatoeba.
jbo: mi na jufra .i bilga lo nu vimcu mi la.tatoebas.

source: He is her friend.
jbo: le nakni cu pendo le fetsi

source: Rabbits have long ears.
jbo: lo'e ractu cu se kerlo lo clani

source: My father can swim, but my mother can't.
jbo: lo mi patfu cu kakne lo nu limna .i ku'i lo mi mamta na kakne lo nu limna

source: Ask only questions that can be answered with yes or no.
jbo: ko te preti fi lo preti poi vasru zo xu ku'o ku po'o

source: He goes to school by bus.
jbo: ko'a klama lo ckule fu lo aftobuso

source: What came first? The egg or the hen?
jbo: lo cipni ji lo sovda cu pamoi tolcanci

source: He forgot that he bought her a present.
jbo: ko'a tolmo'i lo du'u ko'a terve'u lo seldu'a befi ko'e

source: There's a woman as wants to see you.
jbo: lo ninmu cu djica lo nu penmi do

source: I've forgotten your number.
jbo: mi tolmo'i lo fonjudri be do

source: Let it go!
jbo: .e'u .u'anai

source: The natural sciences are harder than the social sciences.
jbo: lo munje saske cu zmadu lo jikca saske lo ka pluja

source: I have to go to school.
jbo: mi bilga lo nu klama lo ckule

source: You don't think that that is weird at all?
jbo: xu do na pensi lo du'u ta cizra

source: I can hear everything.
jbo: mi ka'e tirna ro da

source: The cat sleeps on the table.
jbo: lo mlatu cu sipna bu'u lo jubme

source: Does she play piano?
jbo: xu ra se zgica'a lo pipno

source: Why did I do that?
jbo: mu'i ma mi co'e

source: I am a translator.
jbo: mi fanvypre

source: That'll be three euros.
jbo: se jdima lo ci rupne'uru

source: Japan's shame, the result of the Pacific War, has not yet faded.
jbo: lo su'u la pongu'e cu toljgi kei noi jalge tu'a la .pasifik. zei nunjamna na mo'u canci

source: Hi.
jbo: coi

source: He likes fishing.
jbo: nelci lo nu kalte lo finpe

source: No beer before four!
jbo: no birje pu lo nu se tcika be li vo

source: Nicholas and Maria love each other.
jbo: la nikolas la marias cu simxu lo ka prami

source: The two women know each other.
jbo: re ninmu soi vo'a slabu

source: He will pay for everything.
jbo: ko'a ba pleji fo ro da

source: I am trying to learn English.
jbo: mi troci lo nu mi cilre fi lo bangenugu

source: Wang Lao Ji isn't beer. It's tea.
jbo: la .uan.laos.dzis. na'e birje .i lo go'i ku tcati

source: In the end I ran to the station, and somehow got there on time.
jbo: mi bajra le tcana gi'e .ue banzu clira

source: English is difficult, innit?
jbo: lo glibau cu nandu vau je'u pei

source: Would you like to go to a movie tomorrow night?
jbo: aupei mi'o velskina ca le bavlamcte

source: How do you explain that?
jbo: do ciksi la'e di'u fo ma

source: Those girls are prostitutes.
jbo: ta nixli cu gleve'u

source: "Aix-la-Chapelle" is Aachen in German.
jbo: la'oi Aix-la-Chapelle se fanva fu la'oi Aachen fo lo bandu'e'u

source: What is your favorite sentence?
jbo: ma traji lo ka do nelci ku fo lo jufra

source: There are only 80 Uyghurs in Switzerland.
jbo: lo mo'a bino me la .uigur. cu zvati la .xelvetik.

source: We don't have sugar.
jbo: mi na ralte lo sukta

source: I sometimes watch TV.
jbo: mi ta'enai catlu lo seltivni

source: This is a Turkish tradition.
jbo: ti tu'urki tcaci

source: The sentence you're reading doesn't exist.
jbo: di'u na zasti

source: This sentence doesn't mean anything.
jbo: di'u selsmu noda

source: This is not a sentence.
jbo: dei na jufra

source: Ken has two cats.
jbo: la .ken. cu ralte re lo mlatu

source: I always keep promises.
jbo: mi gasnu ro se nupre

source: I have a black dog and a white dog.
jbo: mi raltefe lo xekri gerku fe lo blabi gerku

source: Why did you lie?
jbo: mu'i ma do ticysku

source: No prob.
jbo: vi'o

source: No problem.
jbo: vi'o

source: I sometimes have pain in my stomach.
jbo: mi so'i roi cortu lo runtyrango

source: Beer is prohibited before 4:00.
jbo: tu'a lo birje ku se to'e curmi pu lo se tcika be li vo

source: How much is a beer?
jbo: ma jdima lo birje

source: Have you gone completely mad?
jbo: do mo'u fenki pei

source: My name is Ahmad.
jbo: mi'e .axmed.

source: The birch leaves have already turned yellow.
jbo: lo biorka pezli co'i pelxu

source: He's my friend.
jbo: ra pendo mi

source: Italian is my mother tongue.
jbo: lo bangitu'a cu verclibau mi

source: Satoru is the fastest runner out of the five of us.
jbo: la.satorun. cu bajra sutra traji fi mu mi'a

source: The quick brown fox jumps over the lazy dog.
jbo: lo sutra je bunre lorxu cu plipe fo lo galtu be lo lazni gerku

source: It's the truth.
jbo: jetnu

source: More than 3000 people were at the concert.
jbo: za'u ciki'o prenu cu pu zvati lenu zgitigni

source: A small gain is better than a great loss.
jbo: lo cmalu prali cu xagmau lo tolcmalu tolprali

source: He's a fast walker.
jbo: ko'a me lo sutra cadzu

source: The Devil made me do it.
jbo: gau la.pacrid. mi co'e

source: Yikes!
jbo: ii

source: The people from Madrid are crazy.
jbo: loi prenu pe la.madrid. jai fenki

source: Kiss me.
jbo: ko cinba mi

source: Time is money.
jbo: lo jai temci cu jdini

source: How do you write "Eyjafjallajkull"?
jbo: ma tadji lonu ciska zo'oi .Eyjafjallajkull.

source: My name is Sasha.
jbo: mi'e .sacas.

source: Do you like white chocolate?
jbo: xu do nelci lo blabi cakla

source: Please give the baby a bath.
jbo: .e'o ko jirlu'i lo cifnu

source: Don't forget to take an umbrella with you.
jbo: ko na tolmorji lo nu do bevri lo santa

source: He deceased yesterday.
jbo: ra mrobi'o ca lo prulamdei

source: My parents met each other in the mountains.
jbo: loi rirni be mi penmi ca lo cmana

source: My dream is to go to Japan someday.
jbo: .au klama la .nipon. ca da

source: Spring will be here soon.
jbo: zi vensa

source: Frankly, my dear, I don't give a damn.
jbo: .o'e nai doi dirba mi to'e cinmo

source: I need to find my pen.
jbo: mi nitcu lo nu sispe'i lo mi penbi

source: You need to exercise more.
jbo: do nitcu lonu crenzue semauku

source: 'Twas brillig, and the slithy toves did gyre and gimble in the wabe; All mimsy were the borogoves, and the mome raths outgrabe.
jbo: pu brilugi .i loi sliti tovzi ja'a zarna carna zi lo blixa .i pu ku se mimsi lo brogovzi .i je loi zdaraxa pu ku krixa

source: Nice suit.
jbo: pluka ke clite pastu

source: Let's go home!
jbo: e'u klama lo zdani

source: Plato's my friend, but truth I cherish even more.
jbo: .i mi se dirba la. platon .e ku'i mau bo lo nu jetnu

source: Fix the clock.
jbo: cikre lo junla

source: She just left.
jbo: ra puzi mo'u cliva

source: Two days ago the wind blew.
jbo: de'i li vu'u re brife

source: The house is cold.
jbo: le zdani cu lenku

source: Yesterday snow fell.
jbo: ca lo prulamdei ku mo'u snime carvi

source: Do you know it?
jbo: xu do djuno ti

source: Please go right away.
jbo: pe'u cliva zicai

source: Stay at home.
jbo: ko zdani stali

source: Germany shares a border with France.
jbo: korbi lo dotygu'e lo fasygu'e

source: Place the pan in the oven.
jbo: ko setca lo satci lo toknu

source: I'm satisfied.
jbo: mi se mansa da

source: They are good people.
jbo: vrude prenu

source: I don't like eggs.
jbo: mi lo sovda cu tolnelci

source: He's a kind person.
jbo: xendo prenu

source: The skies won't be clear.
jbo: lo za'umei tsani na ba klina

source: The weather won't be fine.
jbo: lo tcima na ba xamgu

source: "If you stop loving the robot, it will take its revenge upon you" "That robot will--" "Yes" " What type of revenge?" "It will kill you"
jbo: lu .i ganai sisti lo du'u do prami lo bi'unai sampre kei gi sy. do ba venfu li'u lu .i sy. goi ta ba li'u lu .i go'i li'u lu .i venfu fo ma li'u lu .i catra do li'u

source: I used to respect you.
jbo: mi pu sinma do

source: Light is much faster than sound.
jbo: loi gusni loi sance cu sutyzma cai

source: Nobody will know.
jbo: no ba djuno

source: The boy was silent.
jbo: lo nanla pu smaji

source: I don't see it.
jbo: mi na viska ta

source: Kate and Brian discuss the picture.
jbo: la .keit. joi la .braiyn. cu casnu le larxra

source: Is the rat alive or dead?
jbo: le ratcu cu jmive gi'i morsi

source: He is Swiss.
jbo: ko'a xelvetiko

source: I have a lot of dreams.
jbo: mi mutce senva

source: Yesterday my uncle bought a dog.
jbo: ca lo prulamdei ku lo me mi nakni famti ku te vecnu lo gerku

source: Your house is big.
jbo: le do zdani cu barda

source: My mother is angry.
jbo: lo me mi mamta ku fengu

source: Don't forget your money.
jbo: ko na tolmo'i tu'a lo do jdini

source: Atheism isn't a religious belief.
jbo: lo za'i nalceikri ku na lijda

source: Tokyo is supposed to be a very safe city.
jbo: da sruma lo du'u la .tokios. cu mutce tolckape tcadu

source: Is her father a doctor?
jbo: xu lo patfu be ra cu mikce

source: I can't talk.
jbo: mi na kakne lo nu tavla

source: The birds fly.
jbo: loi cipni cu vofli

source: Have a drink.
jbo: ko pinxe

source: Hello Mimi! How are you?
jbo: coi mimi .i pei

source: We want complete sentences.
jbo: mi'a djica tu'a lo mulno jufra

source: Change the flag, please.
jbo: e'o ko jai galfi lo lanci

source: They went by subway.
jbo: ra pu klama fu lo tu'unre'e

source: One language is never enough.
jbo: lo pa po'o bangu no roi banzu

source: In space, no one can hear you scream.
jbo: bu'u lo kensa no da ka'e tirna lo nu krixa

source: I own this car.
jbo: mi ralte ti noi karce

source: Do you also know how to use a computer?
jbo: xu do djuno lo du'u ta'i ma kau pilno lo skami

source: Eureka!
jbo: .uacai

source: I speak Interlingua.
jbo: mi se bangu lo banginu'a

source: I'll give anything that isn't this.
jbo: mi dunda ro drata be ti

source: That's true.
jbo: go'i

source: My poor state of mind made me distraught.
jbo: lo du'u le mi menytcini cu xlali kei mi se cordri

source: You're capable.
jbo: do ka'e co'e

source: These are my books, those are his.
jbo: mi se srana lo vi cukta .i ra se srana lo va cukta

source: Nothing had moved.
jbo: noda pu muvdu

source: I ask that you forgive me.
jbo: .e'o ko fraxu

source: He likes to run.
jbo: ra nelci lo nu bajra

source: I am full.
jbo: mi tolxagji

source: That is wet.
jbo: ta cilmo

source: He promised he would help us.
jbo: ko'a nupre lo nu sidju kei ma'a

source: When did you arrive in China?
jbo: ca ma do pu tolyli'a lo jugygu'e

source: I am glad to help you.
jbo: ui mi sidju do

source: Why do people kill themselves?
jbo: seja'e ma lo prenu cu catra lo nei

source: Ah, okay!
jbo: ua .i je'e

source: This is my home.
jbo: ti zdani mi

source: Neither a borrower nor a lender be.
jbo: ko jbera nagi'enai terjbera

source: I was having my lunch, when the phone rang.
jbo: mi pu ca'o citka le mi dormijysai ca lo nu le fonxa ku selsance

source: His toupee looks like a dead cat.
jbo: le ko'a runkre ku tamsmi fi lo morsi mlatu

source: It was a dark and stormy night.
jbo: manku je vilti'a nicte
